package android.media;

class CharacterTables {
    private static final char[] frequent_cn = new char[]{'一', '万', '三', '上', '下', '不', '与', '专', '世', '业', '东', '两', '个', '中', '为', '主', '举', '么', '之', '乐', '也', '书', '买', '了', '事', '二', '于', '五', '亚', '些', '交', '产', '享', '京', '人', '什', '介', '从', '他', '代', '以', '们', '件', '价', '任', '企', '优', '会', '传', '但', '位', '体', '何', '作', '你', '使', '供', '保', '信', '修', '值', '做', '健', '像', '儿', '元', '先', '光', '克', '免', '入', '全', '公', '共', '关', '其', '具', '内', '册', '军', '出', '击', '分', '列', '创', '利', '别', '到', '制', '前', '力', '办', '功', '加', '务', '动', '助', '包', '化', '北', '区', '医', '十', '华', '单', '南', '博', '卡', '原', '去', '参', '及', '友', '反', '发', '受', '变', '口', '只', '可', '台', '号', '司', '各', '合', '同', '名', '后', '向', '吧', '告', '员', '周', '和', '品', '商', '器', '四', '回', '因', '团', '园', '国', '图', '在', '地', '场', '坛', '型', '城', '基', '士', '声', '处', '备', '复', '外', '多', '大', '天', '太', '头', '女', '好', '如', '娱', '子', '字', '学', '安', '完', '定', '宝', '实', '客', '家', '容', '密', '对', '导', '将', '小', '少', '尔', '就', '展', '山', '州', '工', '己', '已', '市', '布', '师', '帖', '带', '帮', '常', '平', '年', '并', '广', '库', '应', '店', '度', '康', '建', '开', '式', '引', '张', '强', '当', '录', '形', '彩', '影', '很', '得', '微', '心', '快', '态', '怎', '性', '总', '息', '您', '情', '想', '意', '感', '戏', '成', '我', '或', '战', '户', '房', '所', '手', '才', '打', '技', '投', '护', '报', '招', '持', '指', '据', '排', '接', '推', '提', '搜', '播', '支', '收', '放', '政', '效', '教', '数', '文', '料', '斯', '新', '方', '旅', '无', '日', '时', '明', '易', '星', '是', '显', '更', '最', '月', '有', '服', '期', '本', '术', '机', '权', '条', '来', '板', '林', '果', '查', '标', '校', '样', '格', '案', '楼', '模', '次', '欢', '款', '正', '此', '比', '民', '气', '水', '求', '江', '没', '治', '法', '注', '活', '流', '测', '海', '消', '深', '清', '游', '源', '火', '点', '热', '然', '照', '爱', '片', '版', '牌', '物', '特', '王', '玩', '现', '球', '理', '生', '用', '由', '电', '男', '界', '病', '登', '白', '百', '的', '盘', '目', '直', '相', '省', '看', '真', '着', '知', '码', '研', '示', '社', '神', '福', '离', '种', '科', '积', '程', '究', '空', '立', '站', '章', '第', '等', '答', '简', '管', '类', '精', '系', '索', '红', '级', '线', '组', '细', '经', '结', '给', '络', '统', '编', '网', '置', '美', '老', '考', '者', '而', '联', '育', '能', '自', '色', '节', '花', '英', '荐', '药', '营', '藏', '行', '表', '被', '装', '西', '要', '见', '观', '规', '视', '解', '言', '计', '认', '让', '议', '讯', '记', '论', '设', '证', '评', '识', '试', '话', '询', '该', '详', '语', '说', '请', '读', '调', '财', '质', '购', '贴', '费', '资', '起', '超', '路', '身', '车', '转', '载', '达', '过', '运', '近', '还', '这', '进', '连', '选', '通', '速', '造', '道', '那', '部', '都', '配', '酒', '里', '重', '量', '金', '销', '长', '门', '问', '间', '闻', '阅', '阳', '际', '限', '院', '集', '需', '面', '音', '页', '项', '频', '题', '风', '食', '首', '香', '马', '验', '高', '龙'};
    private static final char[] frequent_ja = new char[]{'々', 'ぁ', 'あ', 'い', 'う', 'え', 'お', 'か', 'が', 'き', 'ぎ', 'く', 'ぐ', 'け', 'げ', 'こ', 'ご', 'さ', 'ざ', 'し', 'じ', 'す', 'ず', 'せ', 'そ', 'た', 'だ', 'ち', 'っ', 'つ', 'て', 'で', 'と', 'ど', 'な', 'に', 'ね', 'の', 'は', 'ば', 'ぱ', 'ひ', 'び', 'ふ', 'ぶ', 'へ', 'べ', 'ほ', 'ま', 'み', 'む', 'め', 'も', 'ゃ', 'や', 'ゆ', 'ょ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん', 'ァ', 'ア', 'ィ', 'イ', 'ウ', 'ェ', 'エ', 'ォ', 'オ', 'カ', 'ガ', 'キ', 'ギ', 'ク', 'グ', 'ケ', 'ゲ', 'コ', 'ゴ', 'サ', 'ザ', 'シ', 'ジ', 'ス', 'ズ', 'セ', 'ゼ', 'ソ', 'タ', 'ダ', 'チ', 'ッ', 'ツ', 'テ', 'デ', 'ト', 'ド', 'ナ', 'ニ', 'ネ', 'ノ', 'ハ', 'バ', 'パ', 'ヒ', 'ビ', 'ピ', 'フ', 'ブ', 'プ', 'ヘ', 'ベ', 'ペ', 'ホ', 'ボ', 'ポ', 'マ', 'ミ', 'ム', 'メ', 'モ', 'ャ', 'ヤ', 'ュ', 'ユ', 'ョ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ン', 'ヴ', 'ヽ', '一', '万', '三', '上', '下', '不', '世', '中', '主', '予', '事', '二', '井', '交', '京', '人', '今', '介', '仕', '他', '付', '代', '以', '件', '会', '位', '住', '体', '何', '作', '使', '供', '価', '便', '保', '信', '個', '像', '優', '元', '先', '光', '入', '全', '公', '具', '内', '円', '写', '出', '分', '切', '初', '別', '利', '制', '前', '力', '加', '動', '務', '募', '化', '北', '区', '原', '参', '友', '取', '受', '口', '古', '可', '台', '号', '合', '同', '名', '向', '告', '周', '味', '和', '品', '員', '商', '問', '営', '器', '回', '図', '国', '園', '土', '在', '地', '型', '報', '場', '売', '変', '外', '多', '大', '天', '女', '好', '婚', '子', '字', '学', '安', '定', '実', '室', '宮', '家', '容', '対', '専', '小', '少', '屋', '山', '岡', '島', '川', '工', '市', '帯', '常', '平', '年', '広', '店', '度', '庫', '式', '引', '強', '当', '形', '後', '得', '心', '必', '応', '念', '思', '性', '恵', '情', '想', '意', '愛', '感', '成', '戦', '所', '手', '投', '持', '指', '探', '掲', '携', '支', '放', '教', '敦', '数', '文', '料', '新', '方', '旅', '日', '明', '映', '時', '更', '書', '最', '月', '有', '期', '木', '本', '材', '村', '来', '東', '板', '果', '校', '株', '格', '検', '業', '楽', '様', '機', '次', '止', '正', '残', '気', '水', '求', '決', '治', '況', '法', '注', '活', '流', '海', '済', '演', '火', '点', '無', '版', '物', '特', '状', '現', '理', '生', '産', '用', '田', '男', '町', '画', '界', '番', '病', '発', '登', '白', '的', '目', '直', '相', '県', '真', '着', '知', '石', '確', '示', '社', '神', '福', '私', '科', '税', '種', '稿', '空', '立', '笑', '第', '等', '答', '管', '系', '約', '素', '索', '細', '紹', '終', '組', '経', '結', '続', '総', '線', '編', '美', '考', '者', '聞', '職', '育', '能', '腹', '自', '良', '色', '花', '芸', '英', '葉', '行', '術', '表', '製', '西', '要', '見', '規', '覧', '解', '言', '計', '記', '設', '話', '詳', '認', '語', '説', '読', '調', '談', '護', '谷', '販', '買', '資', '質', '購', '身', '車', '転', '載', '込', '近', '返', '追', '送', '通', '速', '連', '運', '過', '道', '達', '違', '選', '部', '都', '配', '重', '野', '金', '録', '長', '門', '開', '間', '関', '阪', '限', '院', '除', '際', '集', '雑', '電', '面', '音', '題', '類', '風', '食', '館', '駅', '験', '高', 'ｗ'};
    private static final char[] frequent_tw = new char[]{'一', '三', '上', '下', '不', '世', '並', '中', '主', '之', '也', '了', '事', '二', '五', '些', '亞', '交', '享', '人', '什', '今', '介', '他', '代', '以', '件', '任', '份', '但', '位', '住', '何', '作', '你', '使', '來', '供', '便', '係', '保', '信', '修', '個', '們', '做', '健', '備', '傳', '像', '價', '優', '元', '先', '光', '免', '兒', '入', '內', '全', '兩', '公', '六', '共', '其', '具', '冊', '再', '出', '分', '列', '別', '利', '到', '則', '前', '創', '力', '功', '加', '助', '動', '務', '包', '化', '北', '區', '十', '南', '博', '卡', '印', '即', '原', '去', '參', '又', '及', '友', '取', '受', '口', '只', '可', '台', '司', '吃', '各', '合', '同', '名', '告', '和', '品', '員', '商', '問', '喜', '單', '嗎', '器', '四', '回', '因', '國', '園', '圖', '團', '在', '地', '型', '城', '基', '報', '場', '士', '外', '多', '大', '天', '太', '奇', '女', '她', '好', '如', '子', '字', '學', '安', '完', '定', '客', '家', '容', '實', '寶', '將', '專', '尋', '對', '導', '小', '少', '就', '展', '山', '工', '己', '已', '市', '師', '帶', '常', '平', '年', '店', '度', '康', '廣', '建', '式', '引', '張', '強', '影', '很', '後', '得', '從', '心', '快', '性', '息', '您', '情', '想', '意', '愛', '感', '應', '成', '我', '或', '戰', '戲', '戶', '房', '所', '手', '才', '打', '找', '技', '投', '拉', '拍', '指', '排', '接', '推', '提', '搜', '摩', '收', '改', '放', '政', '教', '整', '數', '文', '料', '斯', '新', '方', '於', '旅', '日', '明', '易', '星', '是', '時', '更', '書', '最', '會', '月', '有', '服', '期', '未', '本', '東', '板', '林', '果', '查', '格', '案', '條', '業', '樂', '樓', '標', '樣', '機', '檢', '權', '次', '款', '歌', '歡', '正', '此', '每', '比', '民', '氣', '水', '求', '沒', '法', '活', '流', '海', '消', '清', '港', '演', '灣', '為', '無', '然', '照', '熱', '片', '版', '牌', '物', '特', '王', '玩', '現', '球', '理', '生', '產', '用', '由', '男', '界', '留', '畫', '當', '登', '發', '白', '百', '的', '目', '直', '相', '看', '真', '眼', '知', '碼', '示', '社', '神', '票', '福', '私', '科', '程', '種', '積', '空', '立', '站', '章', '第', '等', '管', '節', '篇', '簡', '精', '系', '約', '紅', '級', '細', '組', '結', '給', '統', '經', '網', '線', '縣', '總', '美', '義', '老', '考', '者', '而', '聞', '聯', '聲', '股', '育', '能', '腦', '自', '至', '與', '舉', '色', '花', '英', '華', '萬', '落', '著', '薦', '藏', '藝', '處', '號', '行', '術', '表', '被', '裝', '裡', '製', '西', '要', '見', '視', '覺', '覽', '觀', '解', '言', '訂', '計', '訊', '討', '記', '設', '註', '評', '試', '話', '該', '認', '語', '說', '調', '請', '論', '謝', '證', '識', '議', '護', '讀', '變', '讓', '貨', '買', '費', '資', '賣', '質', '購', '起', '超', '跟', '路', '身', '車', '載', '轉', '近', '送', '這', '通', '速', '造', '連', '進', '遊', '運', '過', '道', '達', '選', '還', '邊', '那', '部', '都', '配', '酒', '醫', '重', '量', '金', '錄', '長', '門', '開', '間', '閱', '關', '阿', '限', '院', '除', '際', '集', '離', '電', '需', '非', '面', '音', '頁', '頭', '題', '類', '風', '食', '餐', '館', '首', '香', '馬', '驗', '體', '高', '麼', '黃', '黑', '點', '龍'};

    CharacterTables() {
    }

    private static boolean isFrequent(char[] array, char c) {
        int start = 0;
        int end = array.length - 1;
        int mid = (end + 0) / 2;
        while (start <= end) {
            if (c == array[mid]) {
                return true;
            }
            if (c > array[mid]) {
                start = mid + 1;
            } else {
                end = mid - 1;
            }
            mid = (start + end) / 2;
        }
        return false;
    }

    static boolean isFrequentCn(char c) {
        return isFrequent(frequent_cn, c);
    }

    static boolean isFrequentJa(char c) {
        return isFrequent(frequent_ja, c);
    }

    static boolean isFrequentTw(char c) {
        return isFrequent(frequent_tw, c);
    }

    static boolean isFrequentHan(char c) {
        if (isFrequentCn(c) || isFrequentTw(c)) {
            return true;
        }
        return isFrequentJa(c);
    }
}
